/*****************************************************************************
* filename
* SYS_INIT.c
*
*
* 描述
* 这个文件实现主程序相关功能函数.
*
*
* (c) 2007 Jiwen Su
*****************************************************************************/
#include "includes.h"
//---------------------------------------------------------------------------


//---------------------------------------------------------------------------
//系统时间
u8	 Timer_100ms = 0; 
bool Timer_100ms_state = FALSE;
u8	 Timer_1s = 0;
bool Timer_1s_state = FALSE;
//---------------------------------------------------------------------------

//----------------------------------------------------------------------------
//温度采集
u16  STM_ADC_DATA[ADC_VALUE_LENGTH];//ADC采集缓存
bool STM_ADC_NEW_DATA = FALSE; //ADC采集标志，true为采集一轮新数据，false 没有新数据
bool STM_ADC_DATA_POS = TRUE; //ADC采集标志，true为前段数据有效，false 后段数据有效
float wenducaijizhi = 0; //探头温度采集值
//----------------------------------------------------------------------------

//---------------------------------------------------------------------------
//MODBUS使用
u8 jieshou_485[8];//485使用
u8 fasong_485[13];//485使用
u8 jieshouweizhi_485 =0;//485使用
u8 fasongweizhi_485 =0;//485使用
bool wanchengjieshou_485 =FALSE;//485使用
u8 JCXI_485_ID = 0; //modbus ID 需要保存在FLASH里
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
//传感器使用
u8 jieshou_232[10];//传感器232使用
u8 fasong_232[13];//传感器232使用
u8 jieshouweizhi =0;//传感器232使用
u8 fasongweizhi =0;//传感器232使用
bool wanchengjieshou_232 =FALSE;//传感器232使用
float qitinongdu =0;//气体浓度
u8 chuanganqizhuangtai =0;//0代表正常，1代表故障，2代表低报，3代表高爆.4高浓度淹没
u16 JCXI_zuidaliangcheng = 255;//最大量程
u16 JCXI_zuixiaoliangcheng = 255;//最小量程
u16 JCXI_gaobaojing= 255;//高报警50
u16 JCXI_dibaojing= 255;//低报警25
u8	JCXI_qitileixing= 255;//气体类型
u8	JCXI_qitidanwei= 255;//气体单位
u8	jcxibuzhou =0;//0最大量程，1最小量程，2高报警，3低报警，4气体类型，5气体单位
u8 jiaozhunbuzhou = 0;//0代表发送校准值 1代表接收显示值 2代表确认
u32 jiaozhunxianshi =0;//校准显示使用
u16 chuanganqijieshou =0;//判断传感器故障使用

u8 uart4_recv_flag = 0;

//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
//有显无显切换
bool LCD_SHOW_YON = TRUE; // 有显无显标志 true 有显  false 无显
bool upxianshimoshi = TRUE;//上次显示状态
bool shifouchushihualcd =FALSE;//是否重新初始化屏幕
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
//显示
u8 xianshimoshi =0;//显示模式0正常显示，1设置菜单，2输入模式，3正确，4错误
u8 caidanweizhi= 0; //菜单位置


//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
//KEY
u8 shuruzu[] ={0,0,0,0,0};//输入数值
u8 zuidacaidanshu = 12;//最大菜单数
u8 zuixiaocaidanshu = 1;//最小菜单数
u8 shuruweizhi = 1;//输入位置
u8 dianliubuzhou =0 ;//1显示值，2确认

//---------------------------------------------------------------------------


//---------------------------------------------------------------------------
//设置
u16  JCXI_420ma4= 490;//4ma值
u16  JCXI_420ma20= 2450;//20ma值
u8 JCXI_jidianqigenshuiDIBAO =1;//低报继电器瞬间输出0，长输出1
u8 JCXI_jidianqigenshuigaobao =1;//低报继电器瞬间输出0，长输出1
bool dibaojidianqishuchuwancheng = FALSE;//低报继电器是否输出完成，false未完成
bool gaobaojidianqishuchuwancheng =FALSE;//高爆继电器是否输出完成，false未完成

//---------------------------------------------------------------------------


//----------------------------------------------------------------------------
void SYS_INIT(void){
	LED_WORK_ON();
	SHOW_PANDUAN();
	LED_ERROR_OFF();
	LED_ALARML_OFF();
	LED_ALARMH_OFF();
}
//-----------------------------------------------------------
/********************************************************************
					SYS_INIT.c的程序到此结束。
*********************************************************************/
