/****************************************Copyright (c)**************************************************
** Modified date:      2012-05-20 
** Version:            v3.0
** Descriptions:       修改用于STM32F10x   
**
**------------------------------------------------------------------------------------------------------
** Modified by: 		
** Modified date:	   
** Version: 		   
** Descriptions:		
**
********************************************************************************************************/

#ifndef _bsp_h_
#define _bsp_h_

#include "includes.h" 

/********************************/
/*       系统配置函数           */
/********************************/
void BSP_Init(void);
void RCC_Configuration(void);
void SysTickInit(void);
void IWDG_Init(void);
void NVIC_Configuration(void);

#ifdef  DEBUG
void assert_failed(u8* file, u32 line)
#endif

#endif

/********************************************************************************************************
**                            End Of File
********************************************************************************************************/


